package restaurant;

public class VegetarianMenu extends MealMenu{
  public VegetarianMenu(){
    addItem("酸辣土豆丝","由鸡丁、干辣椒、花生米等炒制而成：鸡肉鲜嫩配合花生的香脆，广受欢迎。",12,"image/酸辣土豆丝.jpg");
    addItem("火龙吐丝","由鸡丁、干辣椒、花生米等炒制而成：鸡肉鲜嫩配合花生的香脆，广受欢迎。",12,"image/火龙吐丝.jpg");
    addItem("排骨面","由鸡丁、干辣椒、花生米等炒制而成：鸡肉鲜嫩配合花生的香脆，广受欢迎。",18,"image/排骨面.jpg");
    addItem("西芹炒菱角","由鸡丁、干辣椒、花生米等炒制而成：鸡肉鲜嫩配合花生的香脆，广受欢迎。",2,"image/西芹炒菱角.jpg");
    addItem("双丁炒鸡蛋","由鸡丁、干辣椒、花生米等炒制而成：鸡肉鲜嫩配合花生的香脆，广受欢迎。",22,"image/双丁炒鸡蛋.jpg");
    addItem("午烧竹笋","由鸡丁、干辣椒、花生米等炒制而成：鸡肉鲜嫩配合花生的香脆，广受欢迎。",32,"image/午烧竹笋.jpg");
    addItem("杏仁奶豆腐","由鸡丁、干辣椒、花生米等炒制而成：鸡肉鲜嫩配合花生的香脆，广受欢迎。",12,"image/杏仁奶豆腐.jpg");
    addItem("西芹百合","由鸡丁、干辣椒、花生米等炒制而成：鸡肉鲜嫩配合花生的香脆，广受欢迎。",16,"image/西芹百合.jpg");
    addItem("三椒黑木耳","由鸡丁、干辣椒、花生米等炒制而成：鸡肉鲜嫩配合花生的香脆，广受欢迎。",19,"image/三椒黑木耳.jpg");
    addItem("西兰花炒鸡蛋","由鸡丁、干辣椒、花生米等炒制而成：鸡肉鲜嫩配合花生的香脆，广受欢迎。",14,"image/西兰花炒鸡蛋.jpg");
    addItem("海带焖土豆","由鸡丁、干辣椒、花生米等炒制而成：鸡肉鲜嫩配合花生的香脆，广受欢迎。",12,"image/海带焖土豆.jpg");
  }
}